Revit 2027 API
PartMakerMethodToDivideVolumes.IsElementValidIntersectingReference(ElementId) Method
 Identifies if the provided member is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsElementValidIntersectingReference(
	ElementId elementId
)
Public Function IsElementValidIntersectingReference (
	elementId As ElementId
) As Boolean
public:
bool IsElementValidIntersectingReference(
	ElementId^ elementId
)
member IsElementValidIntersectingReference :
        elementId : ElementId -> bool
Parameters
elementId ElementId
 Element ids to be tested for validity for intersecting references.
Return Value
Boolean
 True if the reference is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartMakerMethodToDivideVolumes Class
IsElementValidIntersectingReference Overload
Autodesk.Revit.DB Namespace